m-okada/QV08/emu/ARM/kinetis_workspace/Q8Emu_KV58_SDK12/SDK/platform/hal/src/sim/MKV58F22/fsl_sim_hal_MKV58F22.c
    switch (instance)
    {
    case 0:
        retValue =  SIM_BRD_MISCTRL2_SYNCCMP0SAMPLEWIN(base);
        break;
    case 1:
        retValue =  SIM_BRD_MISCTRL2_SYNCCMP1SAMPLEWIN(base);
        break;
    case 2:
        retValue =  SIM_BRD_MISCTRL2_SYNCCMP2SAMPLEWIN(base);
        break;
    case 3:
        retValue =  SIM_BRD_MISCTRL2_SYNCCMP3SAMPLEWIN(base);
        break;
    default:
        retValue =  false;
        break;
    }

    return retValue;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_SetCmpWinxSrc
 * Description   : Set CMP Sample/Window Input X Source
 * This function controls the sample/window source of CMP module
 *
 *END**************************************************************************/
void SIM_HAL_SetCmpWinxSrc(SIM_Type* base, uint32_t instance,
                                      sim_cmp_win_in_src select)
{
  assert (instance < CMP_INSTANCE_COUNT);
  switch (instance)
    {
    case 0:
        SIM_BWR_MISCTRL_CMPWIN0SRC(base, select);
        break;
    case 1:
        SIM_BWR_MISCTRL_CMPWIN1SRC(base, select);
        break;
    case 2:
        SIM_BWR_MISCTRL_CMPWIN2SRC(base, select);
        break;
    case 3:
        SIM_BWR_MISCTRL_CMPWIN3SRC(base, select);
        break;    
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetCmpWinxSrc
 * Description   : Get CMP Sample/Window Input X Source
 * This function will get the sample/window source of CMP module
 *
 *END**************************************************************************/
sim_cmp_win_in_src SIM_HAL_GetCmpWinxSrc(SIM_Type* base, uint32_t instance)
{
  assert (instance < CMP_INSTANCE_COUNT);
    sim_cmp_win_in_src retValue = (sim_cmp_win_in_src)0;
    switch (instance)
    {
    case 0:
        retValue = (sim_cmp_win_in_src)SIM_BRD_MISCTRL_CMPWIN0SRC(base);
        break;
    case 1:
        retValue = (sim_cmp_win_in_src)SIM_BRD_MISCTRL_CMPWIN1SRC(base);
        break;
    case 2:
        retValue = (sim_cmp_win_in_src)SIM_BRD_MISCTRL_CMPWIN2SRC(base);
        break;
    case 3:
        retValue = (sim_cmp_win_in_src)SIM_BRD_MISCTRL_CMPWIN3SRC(base);
        break;
    default:
        break;
    }

    return retValue;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_SetEwmInSrc
 * Description   : Set EWM_IN source setting
 * This function controls the ewm_in source of EWM module
 *
 *END**************************************************************************/
void SIM_HAL_SetEwmInSrc(SIM_Type* base, sim_ewm_in_src select)
{
        SIM_BWR_MISCTRL_EWMINSRC(base, select);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetEwmInSrc
 * Description   : Get EWM_IN source setting
 * This function will get the ewm_in source of EWM module
 *
 *END**************************************************************************/
sim_ewm_in_src SIM_HAL_GetEwmInSrc(SIM_Type* base)
{
   return (sim_ewm_in_src)SIM_BRD_MISCTRL_EWMINSRC(base);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_SetDacHwTrigSrc
 * Description   : Set DAC x Hardware trigger source setting
 * This function will select the DAC0 Hardware Trigger Input Source
 *
 *END**************************************************************************/
void SIM_HAL_SetDacHwTrigSrc(SIM_Type* base,sim_dac_hw_trg_sel select)
{
        SIM_BWR_MISCTRL_DACTRIGSRC(base, select);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetDacHwTrigSrc
 * Description   : Get DAC x Hardware trigger source setting
 * This function will get the DAC0 Hardware Trigger Input Source
 *
 *END**************************************************************************/
sim_dac_hw_trg_sel SIM_HAL_GetDacHwTrigSrc(SIM_Type* base, uint32_t instance)
{
        return (sim_dac_hw_trg_sel)SIM_BRD_MISCTRL_DACTRIGSRC(base);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_SetFtmExternalClkPinMode
 * Description   : Set FlexTimer x external clock pin select setting
 * This function will select the source of FTMx external clock pin select
 *
 *END**************************************************************************/
void SIM_HAL_SetFtmExternalClkPinMode(SIM_Type* base,
                                      uint32_t instance,
                                      sim_ftm_clk_sel_t select)
{
    assert (instance < FTM_INSTANCE_COUNT);

    switch (instance)
    {
    case 0:
        SIM_BWR_SOPT9_FTM0CLKSEL(base, select);
        break;
    case 1:
        SIM_BWR_SOPT9_FTM1CLKSEL(base, select);
        break;
    case 2:
        SIM_BWR_SOPT9_FTM2CLKSEL(base, select);
        break;
    case 3:
        SIM_BWR_SOPT9_FTM3CLKSEL(base, select);
        break;
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetFtmExternalClkPinMode
 * Description   : Get FlexTimer x external clock pin select setting
 * This function will get FlexTimer x external clock pin select setting.
 *
 *END**************************************************************************/
sim_ftm_clk_sel_t SIM_HAL_GetFtmExternalClkPinMode(SIM_Type* base,
                                                   uint32_t instance)
{
    sim_ftm_clk_sel_t retValue = (sim_ftm_clk_sel_t)0;

    assert (instance < FTM_INSTANCE_COUNT);

    switch (instance)
    {
    case 0:
        retValue = (sim_ftm_clk_sel_t)SIM_BRD_SOPT9_FTM0CLKSEL(base);
        break;
    case 1:
        retValue = (sim_ftm_clk_sel_t)SIM_BRD_SOPT9_FTM1CLKSEL(base);
        break;
    case 2:
        retValue = (sim_ftm_clk_sel_t)SIM_BRD_SOPT9_FTM2CLKSEL(base);
        break;
    case 3:
        retValue = (sim_ftm_clk_sel_t)SIM_BRD_SOPT9_FTM3CLKSEL(base);
        break;
    default:
        break;
    }

    return retValue;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_SetFtmChSrcMode
 * Description   : FlexTimer x channel y input capture source select setting
 * This function will select FlexTimer x channel y input capture source
 *
 *END**************************************************************************/
void SIM_HAL_SetFtmChSrcMode(SIM_Type* base,
                             uint32_t instance,
                             uint8_t  channel,
                             sim_ftm_ch_src_t select)
{
    assert (instance < FTM_INSTANCE_COUNT);

