m-okada/QV08/emu/ARM/kinetis_workspace/Q8Emu_KV58_SDK12/SDK/platform/hal/src/sim/MKV58F22/fsl_sim_hal_MKV58F22.c
    assert(instance < HSADC_INSTANCE_COUNT);
    
    switch (instance)
    {
    case 0:
        switch (convId)
        {
        case kSimHsadcConvA:
            retValue = (sim_hsadc_trg_sel_t)SIM_BRD_SOPT7_HSADC0ATRGSEL(base);
            break;
        case kSimHsadcConvB:
            retValue = (sim_hsadc_trg_sel_t)SIM_BRD_SOPT7_HSADC0BTRGSEL(base);
            break;
        default:
            break;
        }
        break;
    case 1:
        switch (convId)
        {
        case kSimHsadcConvA:
            retValue = (sim_hsadc_trg_sel_t)SIM_BRD_SOPT7_HSADC1ATRGSEL(base);
            break;
        case kSimHsadcConvB:
            retValue = (sim_hsadc_trg_sel_t)SIM_BRD_SOPT7_HSADC1BTRGSEL(base);
            break;
        default:
            break;
        }
        break;
    default:
        break;
    }

    return retValue;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_SetAdcTriggerMode
 * Description   : Set ADCx trigger select setting
 * This function will select the ADCx trigger source when alternative triggers
 * are enabled through ADCxALTTRGEN
 *
 *END**************************************************************************/
void SIM_HAL_SetAdcTriggerMode(SIM_Type * base,
                               uint32_t instance,
                               sim_adc_trg_sel_t select)
{
    assert(instance < ADC_INSTANCE_COUNT);

    SIM_BWR_ADCOPT_ADC0TRGSEL(base, select);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetAdcTriggerMode
 * Description   : Get ADCx trigger select setting
 * This function will get ADCx trigger select setting.
 *
 *END**************************************************************************/
sim_adc_trg_sel_t SIM_HAL_GetAdcTriggerMode(SIM_Type * base, uint32_t instance)
{
    assert(instance < ADC_INSTANCE_COUNT);

    return (sim_adc_trg_sel_t)SIM_BRD_ADCOPT_ADC0TRGSEL(base);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_SetHsadcTriggerModeOneStep
 * Description   : Set HSADCx trigger setting.
 * This function sets HSADC alternate trigger and trigger mode.
 *
 *END**************************************************************************/
void SIM_HAL_SetHsadcTriggerModeOneStep(SIM_Type* base,
                                      uint32_t instance,
									  sim_hsadc_conv_id_t convId,
									  sim_hsadc_alttrg_sel_t altTrigSel,
									  sim_hsadc_trg_sel_t trigSel)
{
    assert(instance < HSADC_INSTANCE_COUNT);

    switch (instance)
    {
    case 0:
        switch (convId)
        {
        case kSimHsadcConvA:
            SIM_BWR_SOPT7_HSADC0ATRGSEL(base, trigSel);
            SIM_BWR_SOPT7_HSADC0AALTTRGEN(base, altTrigSel);
            break;
        case kSimHsadcConvB:
            SIM_BWR_SOPT7_HSADC0BTRGSEL(base, trigSel);
            SIM_BWR_SOPT7_HSADC0BALTTRGEN(base, altTrigSel);
            break;
        default:
            break;
        }
        break;
    case 1:
        switch (convId)
        {
        case kSimHsadcConvA:
            SIM_BWR_SOPT7_HSADC1ATRGSEL(base, trigSel);
            SIM_BWR_SOPT7_HSADC1AALTTRGEN(base, altTrigSel);
            break;
        case kSimHsadcConvB:
            SIM_BWR_SOPT7_HSADC1BTRGSEL(base, trigSel);
            SIM_BWR_SOPT7_HSADC1BALTTRGEN(base, altTrigSel);
            break;
        default:
            break;
        }
        break;
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_SetAdcTriggerModeOneStep
 * Description   : Set ADCx trigger setting.
 * This function sets ADC alternate trigger mode, pre-trigger mode and trigger mode.
 *
 *END**************************************************************************/
void SIM_HAL_SetAdcTriggerModeOneStep(SIM_Type * base,
                                      uint32_t instance,
                                      sim_adc_alttrg_sel_t altTrigSel,
                                      sim_adc_pretrg_sel_t preTrigSel,
                                      sim_adc_trg_sel_t trigSel)
{
    assert(instance < ADC_INSTANCE_COUNT);

    SIM_BWR_ADCOPT_ADC0ALTTRGEN(base, altTrigSel);
    SIM_BWR_ADCOPT_ADC0PRETRGSEL(base, preTrigSel);

    if (altTrigSel == kSimAdcAltTrgselALT)
    {
        SIM_BWR_ADCOPT_ADC0TRGSEL(base, trigSel);
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_SetUartRxSrcMode
 * Description   : Set UARTx receive data source select setting
 * This function will select the source for the UART1 receive data.
 *
 *END**************************************************************************/
void SIM_HAL_SetUartRxSrcMode(SIM_Type* base,
                              uint32_t instance,
                              sim_uart_rxsrc_t select)
{
    assert(instance < FSL_FEATURE_SIM_OPT_UART_COUNT);

    switch (instance)
    {
    case 0:
        SIM_BWR_SOPT5_UART0RXSRC(base, select);
        break;
    case 1:
        SIM_BWR_SOPT5_UART1RXSRC(base, select);
        break;
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetUartRxSrcMode
 * Description   : Get UARTx receive data source select setting
 * This function will get UARTx receive data source select setting.
 *
 *END**************************************************************************/
sim_uart_rxsrc_t SIM_HAL_GetUartRxSrcMode(SIM_Type* base, uint32_t instance)
{
    sim_uart_rxsrc_t retValue = (sim_uart_rxsrc_t)0;

    assert(instance < FSL_FEATURE_SIM_OPT_UART_COUNT);

    switch (instance)
    {
    case 0:
        retValue = (sim_uart_rxsrc_t)SIM_BRD_SOPT5_UART0RXSRC(base);
        break;
    case 1:
        retValue = (sim_uart_rxsrc_t)SIM_BRD_SOPT5_UART1RXSRC(base);
        break;
    default:
        break;
    }

    return retValue;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_SetUartTxSrcMode
 * Description   : Set UARTx transmit data source select setting
 * This function will select the source for the UARTx transmit data.
 *
 *END**************************************************************************/
void SIM_HAL_SetUartTxSrcMode(SIM_Type* base,
                              uint32_t instance,
                              sim_uart_txsrc_t select)
{
    assert(instance < FSL_FEATURE_SIM_OPT_UART_COUNT);

